orgnotes/Aula1811.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-20 sáb 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lagrangianas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Edgard Macena Cabral" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Lagrangianas</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1d04151">1. Resumo</a></li>
<li><a href="#orgfad9709">2. Coordenadas generalizadas e graus de liberdade</a>
<ul>
<li><a href="#org7847619">2.1. Outras definições</a></li>
</ul>
</li>
<li><a href="#org57fda62">3. Leis de conservação</a></li>
</ul>
</div>
</div>



<div id="outline-container-org1d04151" class="outline-2">
<h2 id="org1d04151"><span class="section-number-2">1</span> Resumo</h2>
<div class="outline-text-2" id="text-1">
<p>
Vimos nas aulas anteriores que a análise do princío de Hamilton fornecia as equações de movimento em qualquer coordenadas
</p>

<p>
Vimos ainda que para a equação
</p>

\begin{equation}
 H = T - V
\end{equation}

<p>
Obtemos, através de Euler-Lagrange
</p>

\begin{equation}\label{eq:Euler-Lagrange}
\frac{dH}{d\mathbf{r}} - \frac{d}{dt}\left(\dfrac{dH}{d\mathbf{\dot{r}}}\right) = 0
\end{equation}

<p>
Nos fornece as equações do momento e força generalizados (angular e linear)
Façamos um resumo sobre quando devemos usar multiplicadores de Lagrange no
formalismo Lagrangiano
</p>

<p>
O ponto de partida deve ser observar que o formalismo de lagrange está
baseado no princípio de Hamilton. Por sua vez, vimos que se não há vínculos
entre as coordenadas e o movimento, podemos aplicar de maneira simples Euler
Lagrange. Se houver vínculos
</p>

<p>
Portano, vemos que o uso de multiplicadores de Lagrange depende do funcional
L (Lagrangiano) ser função de variáveis que tem vínculos entre si.
</p>

<p>
Podemos ainda generalizar o que vimos até agora para <i>N</i> párticulas
</p>

<p>
Tendo a revisão feita, vamos partir pra generalização para qualquer
coordenada.
</p>
</div>
</div>


<div id="outline-container-orgfad9709" class="outline-2">
<h2 id="orgfad9709"><span class="section-number-2">2</span> Coordenadas generalizadas e graus de liberdade</h2>
<div class="outline-text-2" id="text-2">
<p>
Dizemos que \(q_1, q_2, ..., q_n\) é um conjunto de <i>coordenadas generalizadas</i> se
a posição de toda partícula do sistema é uma função dessas variáveis
</p>

\begin{equation}\label{eq:coordenadas generalizadas}
\mathbf{r_i} = \mathbf{r_i}(q_1, q_2, ..., q_n)
\end{equation}

<p>
em que \(\mathbf{r_i}\) é a i-ésima coordenada
</p>

<ul class="org-ul">
<li><p>
Pendulo simples
\(\mathbf{r} = \mathbf{r}(x,y)\)
\(\mathbf{r} = \mathbf{r}(\theta)\)
</p>

<p>
São ambas coordenadas generalizadas de \(\mathbf{r}\)
</p></li>
</ul>

<p>
O número de graus de liberdade de um sistema é dado pelo número de
coordenadas que podem variar independentemente
</p>

<p>
Se o número de coordenadas generalizadas é igual ao de graus de liberdade, o
conjunto é chamado de próprio
</p>
</div>
<div id="outline-container-org7847619" class="outline-3">
<h3 id="org7847619"><span class="section-number-3">2.1</span> Outras definições</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Sistema holonômico:
Sistema no qual as equações de vínculo podem ser usadas pra eliminar
algumas coordenadas, reduzindo-se o número total de coordenadas. Vinculos
do tipo \(g(\{q_i\},t = 0)\) são holonômicos</li>
<li><p>
Sistema forçado
Se a eliminação de coordenadas introduzir funções explícitoas do tempo, o
sistema é dito forçado, se os vínculos são tais que que \(\mathbf{r}\)
não depende explicitamente de \(t\), o sistema é dito <b>natural</b>
</p>

<p>
Se o sistema for natural, \(T\) é a soma de das energias cinéticas devido as
energias cinéticas generalizadas, apenas com termos quadráticos.
</p></li>
</ul>

<p>
Vamos agora determinar as equações de movimento em termos de coordenadas
generalizadas.
</p>

<p>
Se \(\{q_i\}\) for um conjunto próprio, e o sistema tiver \(s\) <span class="underline">graus de liberdade</span>
</p>

  \begin{equation}
equação
  \end{equation}

<p>
Obtivemos tal resultado considerando:
</p>
<ol class="org-ol">
<li>As forças consideradas até agora são todas conservativas ou de vínculo</li>
<li>Os vínculos usados até aqui são todos holonômicos</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org57fda62" class="outline-2">
<h2 id="org57fda62"><span class="section-number-2">3</span> Leis de conservação</h2>
<div class="outline-text-2" id="text-3">
<p>
Observe que se uma coordenada própria não aparecer explicitamente na
lagrangiana, equação para essa coordenada sera
</p>

  \begin{equation}
\frac{\partial L}{\partial q_{\alpha}} - \frac{d}{dt}\left(\frac{\partial L}{\partial \dot{q}_{\alpha}} \right) = 0
  \end{equation}

<p>
Temos então
</p>
 \begin{equation}
\frac{d}{dt}\left(\frac{\partial L}{\partial \dot{q}_{\alpha}}\right) = 0
 \end{equation}
<p>
Que é uma constante do movimento
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Edgard Macena Cabral</p>
<p class="date">Created: 2021-11-20 sáb 00:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
